---
kind: enumMember
id: F:Autodesk.Revit.DB.Mechanical.RiseDropSymbol.TeeHalfCircle
enum: Autodesk.Revit.DB.Mechanical.RiseDropSymbol
source: html/e71323a6-1a21-e28b-a137-963563302e59.htm
---
# Autodesk.Revit.DB.Mechanical.RiseDropSymbol.TeeHalfCircle

Pipe 1 Line junction 1/2 circle on each side